[Survived] BlockStatement
main/components/Sections/SectionsTable.js:247:26
       accessor: "section.enrollCode",
       disableGroupBy: true,
       // No need for accessor if it's purely for actions like expand/collapse
-      Cell: ({ row }) => {
-        // Stryker disable all : difficult to test modal interaction
-        /* istanbul ignore next : difficult to test modal interaction*/
-        if (isSection(row.original.section.section) && currentUser.loggedIn) {
-          return (
-            <div className="d-flex align-items-center gap-2">
-              <AddToScheduleModal
-                section={row.original}
-                quarter={row.original.courseInfo.quarter}
-                onAdd={(section, schedule) =>
-                  handleAddToSchedule(section, schedule, mutation)
-                }
-              />
-            </div>
-          );
-        } else {
-          return null;
-        }
-        // Stryker restore all
-      },
+      Cell: ({ row }) => {},
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value }, row }) => /* istanbul ignore next */ {
