[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:41:10
   });
 
   const objectToAxiosParamsUpdateCoursesJob = (data) => ({
-    url: `/api/jobs/launch/updateCourses?quarterYYYYQ=${data.quarter}&subjectArea=${data.subject}&ifStale=${data.ifStale}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/updateCourses?quarterYYYYQ=20211&subjectArea=ANTH&ifStale=true"
Received: ""

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:134:5
       name: "Test Job",
       form: <TestJobForm submitAction={submitTestJob} />,
     },
-    {
-      name: "Clear Job Logs",
-      form: <ClearJobsForm callback={clearJobs} />,
-    },
+    {},
     {
       name: "Update Courses Database",
killedBy: AdminJobsPage tests user can clear jobs
statusReason: Error: Unable to find an element with the text: Clear Job Logs. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
