[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:45:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="me-auto">
-              {systemInfo?.springH2ConsoleEnabled && (
-                <>
-                  <Nav.Link href="/h2-console/index.html">H2Console </Nav.Link>
-                </>
-              )}
+              {true}
               {systemInfo?.showSwaggerUILink && (
                 <>
killedBy: AppNavbar tests renders H2Console and Swagger links correctly
statusReason: Error: Unable to find an element with the text: H2Console. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:58:16
             </Nav>
 
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link
-                  href="/personalschedules/list"
-                  data-testid="appnavbar-personalschedules-list"
-                >
-                  Personal Schedules
-                </Nav.Link>
-              )}
+              {hasRole(currentUser, "ROLE_USER") || <Nav.Link href="/personalschedules/list" data-testid="appnavbar-personalschedules-list">
+                  Personal Schedules
+                </Nav.Link>}
               <Nav.Link href="/" data-testid="appnavbar-mainsearch-list">
                 Main Search
killedBy: AppNavbar tests renders Personal Schedules and Courses links correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Personal Schedules. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:58:16
             </Nav>
 
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_USER") && (
-                <Nav.Link
-                  href="/personalschedules/list"
-                  data-testid="appnavbar-personalschedules-list"
-                >
-                  Personal Schedules
-                </Nav.Link>
-              )}
+              {true}
               <Nav.Link href="/" data-testid="appnavbar-mainsearch-list">
                 Main Search
killedBy: AppNavbar tests renders Personal Schedules and Courses links correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Personal Schedules. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="color-nav navbar navbar-expand-xl navbar-dark sticky-top"
      data-testid="AppNavbar"
