[Killed] BlockStatement
main/components/Jobs/SingleButtonJobForm.js:3:52
 import { Form, Button, Container, Row, Col } from "react-bootstrap";
 
-const SingeButtonJobForm = ({ callback, text }) => {
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback();
-  };
-
-  // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
-  return (
-    <Form onSubmit={handleSubmit}>
-      <Container>
-        <Row style={{ paddingTop: 10, paddingBottom: 10 }}>
-          <Col md="auto">
-            <Button
-              variant="primary"
-              type="submit"
-              data-testid="singleButtonJobForm-Submit"
-            >
-              {text || "Button"}
-            </Button>
-          </Col>
-        </Row>
-      </Container>
-    </Form>
-  );
-};
+const SingeButtonJobForm = ({ callback, text }) => {};
 
 export default SingeButtonJobForm;
killedBy: AdminJobsPage tests user can submit update grade info
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update Grades. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Jobs/SingleButtonJobForm.js:4:35
 import { Form, Button, Container, Row, Col } from "react-bootstrap";
 
 const SingeButtonJobForm = ({ callback, text }) => {
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback();
-  };
+  const handleSubmit = (event) => {};
 
   // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
killedBy: AdminJobsPage tests user can submit update grade info
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
