[Killed] BlockStatement
main/components/Jobs/ClearJobsForm.js:3:41
 import { Form, Button, Container, Row, Col } from "react-bootstrap";
 
-const ClearJobsForm = ({ callback }) => {
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback();
-  };
-
-  // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
-  return (
-    <Form onSubmit={handleSubmit}>
-      <Container>
-        <Row style={{ paddingTop: 10, paddingBottom: 10 }}>
-          <Col md="auto">
-            <Button
-              variant="primary"
-              type="submit"
-              data-testid="clearJobsSubmit"
-            >
-              Clear
-            </Button>
-          </Col>
-        </Row>
-      </Container>
-    </Form>
-  );
-};
+const ClearJobsForm = ({ callback }) => {};
 
 export default ClearJobsForm;
killedBy: ClearJobsForm tests renders correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Clear/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] BlockStatement
main/components/Jobs/ClearJobsForm.js:4:35
 import { Form, Button, Container, Row, Col } from "react-bootstrap";
 
 const ClearJobsForm = ({ callback }) => {
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback();
-  };
+  const handleSubmit = (event) => {};
 
   // Stryker disable all : Stryker is testing by changing the padding to 0. But this is simply a visual optimization as it makes it look better
