[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:134:13
       form: <TestJobForm submitAction={submitTestJob} />,
     },
     {
-      name: "Clear Job Logs",
+      name: "",
       form: <SingleButtonJobForm callback={clearJobs} text={"Clear"} />,
     },
killedBy: AdminJobsPage tests user can clear jobs
statusReason: Error: Unable to find an element with the text: Clear Job Logs. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:135:61
     },
     {
       name: "Clear Job Logs",
-      form: <SingleButtonJobForm callback={clearJobs} text={"Clear"} />,
+      form: <SingleButtonJobForm callback={clearJobs} text={""} />,
     },
     {
killedBy: AdminJobsPage tests user can clear jobs
statusReason: TestingLibraryElementError: Unable to find an element with the text: Clear. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:157:5
         />
       ),
     },
-    {
-      name: "Update Grade Info",
-      form: (
-        <SingleButtonJobForm
-          callback={submitUpdateGradeInfoJob}
-          text={"Update Grades"}
-        />
-      ),
-    },
+    {},
   ];
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update Grade Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
