[Killed] BlockStatement
main/components/Jobs/JobsTable.js:11:37
 export default function JobsTable({ jobs }) {
   const testid = "JobsTable";
 
-  const formatLog = (log, jobId) => {
-    const logText = typeof log === "string" ? log : String(log);
-    const lines = logText.split("\n");
-
-    if (lines.length <= 10) {
-      return <pre>{lines.join("\n")}</pre>;
-    } else {
-      const firstTenLines = lines.slice(0, 10).join("\n");
-      return (
-        <div>
-          <pre>{firstTenLines}</pre>
-          <span>...</span>
-          <br />
-          <Link
-            to={`/admin/jobs/logs/${jobId}`}
-            data-testid={`JobsTable-log-link-${jobId}`}
-          >
-            [See entire log]
-          </Link>
-        </div>
-      );
-    }
-  };
+  const formatLog = (log, jobId) => {};
 
   const columns = [
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:12:21
   const testid = "JobsTable";
 
   const formatLog = (log, jobId) => {
-    const logText = typeof log === "string" ? log : String(log);
+    const logText = true ? log : String(log);
     const lines = logText.split("\n");
 
killedBy: JobsTable tests renders correctly with no logs available
statusReason: TypeError: Cannot read properties of null (reading 'split')

[Killed] EqualityOperator
main/components/Jobs/JobsTable.js:12:21
   const testid = "JobsTable";
 
   const formatLog = (log, jobId) => {
-    const logText = typeof log === "string" ? log : String(log);
+    const logText = typeof log !== "string" ? log : String(log);
     const lines = logText.split("\n");
 
killedBy: JobsTable tests renders correctly with no logs available
statusReason: TypeError: Cannot read properties of null (reading 'split')

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:13:33
 
   const formatLog = (log, jobId) => {
     const logText = typeof log === "string" ? log : String(log);
-    const lines = logText.split("\n");
+    const lines = logText.split("");
 
     if (lines.length <= 10) {
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  H e l l o W o r l...[See entire log]

[Killed] EqualityOperator
main/components/Jobs/JobsTable.js:15:9
     const logText = typeof log === "string" ? log : String(log);
     const lines = logText.split("\n");
 
-    if (lines.length <= 10) {
+    if (lines.length > 10) {
       return <pre>{lines.join("\n")}</pre>;
     } else {
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Line Line Line Line Line Line Line Line Line Line...[See entire log]"
Received: "Line Line Line Line Line Line Line Line Line Line Line Line"

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:15:9
     const logText = typeof log === "string" ? log : String(log);
     const lines = logText.split("\n");
 
-    if (lines.length <= 10) {
+    if (true) {
       return <pre>{lines.join("\n")}</pre>;
     } else {
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Line Line Line Line Line Line Line Line Line Line...[See entire log]"
Received: "Line Line Line Line Line Line Line Line Line Line Line Line"

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:16:31
     const lines = logText.split("\n");
 
     if (lines.length <= 10) {
-      return <pre>{lines.join("\n")}</pre>;
+      return <pre>{lines.join("")}</pre>;
     } else {
       const firstTenLines = lines.slice(0, 10).join("\n");
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  Hello World! from test job!Goodbye from test job!

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:17:12
 
     if (lines.length <= 10) {
       return <pre>{lines.join("\n")}</pre>;
-    } else {
-      const firstTenLines = lines.slice(0, 10).join("\n");
-      return (
-        <div>
-          <pre>{firstTenLines}</pre>
-          <span>...</span>
-          <br />
-          <Link
-            to={`/admin/jobs/logs/${jobId}`}
-            data-testid={`JobsTable-log-link-${jobId}`}
-          >
-            [See entire log]
-          </Link>
-        </div>
-      );
-    }
+    } else {}
   };
 
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Line Line Line Line Line Line Line Line Line Line...[See entire log]"
Received: ""

[Killed] MethodExpression
main/components/Jobs/JobsTable.js:18:29
     if (lines.length <= 10) {
       return <pre>{lines.join("\n")}</pre>;
     } else {
-      const firstTenLines = lines.slice(0, 10).join("\n");
+      const firstTenLines = lines.join("\n");
       return (
         <div>
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Line Line Line Line Line Line Line Line Line Line...[See entire log]"
Received: "Line Line Line Line Line Line Line Line Line Line Line Line...[See entire log]"

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:18:53
     if (lines.length <= 10) {
       return <pre>{lines.join("\n")}</pre>;
     } else {
-      const firstTenLines = lines.slice(0, 10).join("\n");
+      const firstTenLines = lines.slice(0, 10).join("");
       return (
         <div>
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Line Line Line Line Line Line Line Line Line Line...[See entire log]"
Received: "LineLineLineLineLineLineLineLineLineLine...[See entire log]"

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:26:26
           <br />
           <Link
             to={`/admin/jobs/logs/${jobId}`}
-            data-testid={`JobsTable-log-link-${jobId}`}
+            data-testid={``}
           >
             [See entire log]
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="JobsTable-log-link-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:40:27
       Header: "ID",
       accessor: "id", // accessor is the "key" in the data
     },
-    DateColumn("Created", (cell) => cell.row.original.createdAt),
+    DateColumn("Created", () => undefined),
     DateColumn("Updated", (cell) => cell.row.original.updatedAt),
     {
killedBy: AdminJobsPage tests renders without crashing
statusReason: RangeError: Invalid time value

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:40:16
       Header: "ID",
       accessor: "id", // accessor is the "key" in the data
     },
-    DateColumn("Created", (cell) => cell.row.original.createdAt),
+    DateColumn("", (cell) => cell.row.original.createdAt),
     DateColumn("Updated", (cell) => cell.row.original.updatedAt),
     {
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:41:27
       accessor: "id", // accessor is the "key" in the data
     },
     DateColumn("Created", (cell) => cell.row.original.createdAt),
-    DateColumn("Updated", (cell) => cell.row.original.updatedAt),
+    DateColumn("Updated", () => undefined),
     {
       Header: "Status",
killedBy: AdminJobsPage tests renders without crashing
statusReason: RangeError: Invalid time value

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.js:42:5
     },
     DateColumn("Created", (cell) => cell.row.original.createdAt),
     DateColumn("Updated", (cell) => cell.row.original.updatedAt),
-    {
-      Header: "Status",
-      accessor: "status",
-    },
+    {},
     CustomComponentColumn("Log", (cell) =>
       formatLog(cell.row.original.log, cell.row.original.id),
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:46:34
       Header: "Status",
       accessor: "status",
     },
-    CustomComponentColumn("Log", (cell) =>
-      formatLog(cell.row.original.log, cell.row.original.id),
+    CustomComponentColumn("Log", () => undefined,
     ),
   ];
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:

[Killed] ArrowFunction
main/components/Jobs/JobsTable.js:52:5
   ];
 
   const sortees = React.useMemo(
-    () => [
-      {
-        id: "id",
-        desc: true,
-      },
-    ],
+    () => undefined,
     // Stryker disable next-line all
     [],
killedBy: JobsTable tests renders without crashing for empty table
statusReason: TypeError: Cannot read properties of undefined (reading 'find')

[Survived] ObjectLiteral
main/components/Jobs/JobsTable.js:53:7
 
   const sortees = React.useMemo(
     () => [
-      {
-        id: "id",
-        desc: true,
-      },
+      {},
     ],
     // Stryker disable next-line all

[Survived] StringLiteral
main/components/Jobs/JobsTable.js:54:13
   const sortees = React.useMemo(
     () => [
       {
-        id: "id",
+        id: "",
         desc: true,
       },

[Survived] BooleanLiteral
main/components/Jobs/JobsTable.js:55:15
     () => [
       {
         id: "id",
-        desc: true,
+        desc: false,
       },
     ],
