[Survived] ObjectLiteral
main/pages/Admin/AdminJobsPage.js:37:47
     testJobMutation.mutate(data);
   };
   // ***** update courses job *******
-  const objectToAxiosParamsClearJobs = () => ({
-    url: "/api/jobs/all",
-    method: "DELETE",
-  });
+  const objectToAxiosParamsClearJobs = () => ({});
 
   const objectToAxiosParamsUpdateCoursesJob = (data) => ({
