[Killed] BlockStatement
main/components/Utils/Plaintext.js:11:7
   }
 
   let textToRender;
-  try {
-    // Safely stringify if not already a string
-    textToRender =
-      typeof text === "string" ? text : JSON.stringify(text, null, 2);
-  } catch (error) {
+  try {} catch (error) {
     textToRender = "[Unserializable Object]";
   }
killedBy: Plaintext tests renders the correct text
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] ConditionalExpression
main/components/Utils/Plaintext.js:14:7
   try {
     // Safely stringify if not already a string
     textToRender =
-      typeof text === "string" ? text : JSON.stringify(text, null, 2);
+      true ? text : JSON.stringify(text, null, 2);
   } catch (error) {
     textToRender = "[Unserializable Object]";
killedBy: Plaintext tests works on non-text types
statusReason: TypeError: textToRender.split is not a function or its return value is not iterable

[Killed] ConditionalExpression
main/components/Utils/Plaintext.js:14:7
   try {
     // Safely stringify if not already a string
     textToRender =
-      typeof text === "string" ? text : JSON.stringify(text, null, 2);
+      false ? text : JSON.stringify(text, null, 2);
   } catch (error) {
     textToRender = "[Unserializable Object]";
killedBy: Plaintext tests renders the correct text
statusReason: Error: Unable to find an element with the text: foo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <pre
      data-testid="plaintext"
    >

[Survived] BlockStatement
main/components/Utils/Plaintext.js:15:19
     // Safely stringify if not already a string
     textToRender =
       typeof text === "string" ? text : JSON.stringify(text, null, 2);
-  } catch (error) {
-    textToRender = "[Unserializable Object]";
-  }
+  } catch (error) {}
 
   const [firstLine, ...rest] = textToRender.split("\n");

[Killed] ArrowFunction
main/components/Utils/Plaintext.js:25:17
   return (
     <pre data-testid="plaintext">
       <span key={"0"}>{firstLine}</span>
-      {rest.map((line, index) => (
-        // Stryker disable next-line ArithmeticOperator : key value is internal to React and not exposed to tests
-        <PlaintextLine key={index + 1} text={line} />
-      ))}
+      {rest.map(() => undefined)}
     </pre>
   );
killedBy: Plaintext tests renders the correct text
statusReason: TestingLibraryElementError: Unable to find an element with the text: bar. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <pre
      data-testid="plaintext"
    >
