[Killed] ConditionalExpression
src/main/components/OurTable.js:14:5
 }) {
   // Validate data
   if (
-    !(Array.isArray(data) && data.every((value) => typeof value === "object"))
+    false
   ) {
     throw new Error("Invalid data value");
killedBy: OurTable tests rejects invalid data values
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "Invalid data value"
Received message:   "data.forEach is not a function"

      75 |       rows,
      76 |       prepareRow
    > 77 |     } = useTable(stryMutAct_9fa48("85") ? {} : (stryCov_9fa48("85"), {

[Killed] ArrowFunction
src/main/components/OurTable.js:14:41
 }) {
   // Validate data
   if (
-    !(Array.isArray(data) && data.every((value) => typeof value === "object"))
+    !(Array.isArray(data) && data.every(() => undefined))
   ) {
     throw new Error("Invalid data value");
killedBy: OurTable tests renders a table with two rows without crashing
statusReason: Error: Invalid data value

[Killed] BlockStatement
src/main/components/OurTable.js:15:5
   // Validate data
   if (
     !(Array.isArray(data) && data.every((value) => typeof value === "object"))
-  ) {
-    throw new Error("Invalid data value");
-  }
+  ) {}
 
   const { getTableProps, getTableBodyProps, headerGroups, rows, prepareRow } =
killedBy: OurTable tests rejects invalid data values
statusReason: Error: expect(received).toThrowError(expected)

Expected substring: "Invalid data value"
Received message:   "data.forEach is not a function"

      75 |       rows,
      76 |       prepareRow
    > 77 |     } = useTable(stryMutAct_9fa48("85") ? {} : (stryCov_9fa48("85"), {

[Killed] ArrowFunction
src/main/components/OurTable.js:34:27
   return (
     <Table {...getTableProps()} striped bordered hover>
       <thead>
-        {headerGroups.map((headerGroup) => (
-          <tr
-            {...headerGroup.getHeaderGroupProps()}
-            key={
-              headerGroup.id ||
-              headerGroup.headers.map((col) => col.id).join("-")
-            }
-          >
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps(column.getSortByToggleProps())}
-                key={column.id}
-                data-testid={`${testid}-header-${column.id}`}
-              >
-                {column.render("Header")}
-                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
-                </span>
-              </th>
-            ))}
-          </tr>
-        ))}
+        {headerGroups.map(() => undefined)}
       </thead>
       <tbody {...getTableBodyProps()}>
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button>
        Back

[Killed] LogicalOperator
src/main/components/OurTable.js:38:15
           <tr
             {...headerGroup.getHeaderGroupProps()}
             key={
-              headerGroup.id ||
-              headerGroup.headers.map((col) => col.id).join("-")
+              headerGroup.id && headerGroup.headers.map(col => col.id).join("-")
             }
           >
killedBy: Section Searches Index Page tests calls UCSB section search api correctly with 1 section response
statusReason: Error: Unable to find an element by: [data-testid="BasicSearch.Subject-option-ANTH"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] ConditionalExpression
src/main/components/OurTable.js:38:15
           <tr
             {...headerGroup.getHeaderGroupProps()}
             key={
-              headerGroup.id ||
-              headerGroup.headers.map((col) => col.id).join("-")
+              false
             }
           >

[Survived] ArrowFunction
src/main/components/OurTable.js:39:39
             {...headerGroup.getHeaderGroupProps()}
             key={
               headerGroup.id ||
-              headerGroup.headers.map((col) => col.id).join("-")
+              headerGroup.headers.map(() => undefined).join("-")
             }
           >

[Survived] StringLiteral
src/main/components/OurTable.js:39:61
             {...headerGroup.getHeaderGroupProps()}
             key={
               headerGroup.id ||
-              headerGroup.headers.map((col) => col.id).join("-")
+              headerGroup.headers.map((col) => col.id).join("")
             }
           >

[Killed] ArrowFunction
src/main/components/OurTable.js:42:38
               headerGroup.headers.map((col) => col.id).join("-")
             }
           >
-            {headerGroup.headers.map((column) => (
-              <th
-                {...column.getHeaderProps(column.getSortByToggleProps())}
-                key={column.id}
-                data-testid={`${testid}-header-${column.id}`}
-              >
-                {column.render("Header")}
-                <span data-testid={`${testid}-header-${column.id}-sort-carets`}>
-                  {column.isSorted ? (column.isSortedDesc ? " 🔽" : " 🔼") : ""}
-                </span>
-              </th>
-            ))}
+            {headerGroup.headers.map(() => undefined)}
           </tr>
         ))}
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <button>
        Back

[Killed] StringLiteral
src/main/components/OurTable.js:46:30
               <th
                 {...column.getHeaderProps(column.getSortByToggleProps())}
                 key={column.id}
-                data-testid={`${testid}-header-${column.id}`}
+                data-testid={``}
               >
                 {column.render("Header")}
killedBy: OurTable tests default testid is testId
statusReason: Error: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Timeout] BlockStatement
src/main/components/OurTable.js:58:28
         ))}
       </thead>
       <tbody {...getTableBodyProps()}>
-        {rows.map((row) => {
-          prepareRow(row);
-          return (
-            <tr
-              {...row.getRowProps()}
-              key={row.id || row.original.id || row.index} // Ensure a unique fallback key
-            >
-              {row.cells.map((cell) => (
-                <td
-                  {...cell.getCellProps()}
-                  key={cell.column.id}
-                  data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                >
-                  {cell.render("Cell")}
-                </td>
-              ))}
-            </tr>
-          );
-        })}
+        {rows.map((row) => {})}
       </tbody>
     </Table>

[Survived] ConditionalExpression
src/main/components/OurTable.js:63:20
           return (
             <tr
               {...row.getRowProps()}
-              key={row.id || row.original.id || row.index} // Ensure a unique fallback key
+              key={true} // Ensure a unique fallback key
             >
               {row.cells.map((cell) => (

[Survived] LogicalOperator
src/main/components/OurTable.js:63:20
           return (
             <tr
               {...row.getRowProps()}
-              key={row.id || row.original.id || row.index} // Ensure a unique fallback key
+              key={(row.id || row.original.id) && row.index} // Ensure a unique fallback key
             >
               {row.cells.map((cell) => (

[Timeout] ArrowFunction
src/main/components/OurTable.js:65:30
               {...row.getRowProps()}
               key={row.id || row.original.id || row.index} // Ensure a unique fallback key
             >
-              {row.cells.map((cell) => (
-                <td
-                  {...cell.getCellProps()}
-                  key={cell.column.id}
-                  data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                >
-                  {cell.render("Cell")}
-                </td>
-              ))}
+              {row.cells.map(() => undefined)}
             </tr>
           );

[Killed] BlockStatement
src/main/components/OurTable.js:124:49
   return column;
 }
 
-export function PlaintextColumn(label, getText) {
-  return {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => <Plaintext text={getText(cell)} />,
-  };
-}
+export function PlaintextColumn(label, getText) {}
 
 export function DateColumn(label, getDate) {
killedBy: OurTable tests renders an empty table without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Survived] ArrowFunction
src/main/components/OurTable.js:128:11
   return {
     Header: label,
     id: label,
-    Cell: ({ cell }) => <Plaintext text={getText(cell)} />,
+    Cell: () => undefined,
   };
 }

[Killed] BlockStatement
src/main/components/OurTable.js:132:44
   };
 }
 
-export function DateColumn(label, getDate) {
-  const options = {
-    year: "numeric",
-    month: "numeric",
-    day: "numeric",
-    hour: "numeric",
-    minute: "numeric",
-    second: "numeric",
-    hour12: false,
-    timeZone: "America/Los_Angeles",
-  };
-  return {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => {
-      const date = new Date(getDate(cell));
-      const formattedDate = new Intl.DateTimeFormat("en-US", options).format(
-        date,
-      );
-      return <>{formattedDate}</>;
-    },
-  };
-}
+export function DateColumn(label, getDate) {}
 
 export function CustomComponentColumn(label, renderComponent) {
killedBy: OurTable tests renders an empty table without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
src/main/components/OurTable.js:135:12
 export function DateColumn(label, getDate) {
   const options = {
     year: "numeric",
-    month: "numeric",
+    month: "",
     day: "numeric",
     hour: "numeric",
killedBy: AdminJobsPage tests renders without crashing
statusReason: RangeError: Value  out of range for Intl.DateTimeFormat options property month

[Killed] StringLiteral
src/main/components/OurTable.js:137:11
     year: "numeric",
     month: "numeric",
     day: "numeric",
-    hour: "numeric",
+    hour: "",
     minute: "numeric",
     second: "numeric",
killedBy: AdminJobsPage tests renders without crashing
statusReason: RangeError: Value  out of range for Intl.DateTimeFormat options property hour

[Killed] StringLiteral
src/main/components/OurTable.js:138:13
     month: "numeric",
     day: "numeric",
     hour: "numeric",
-    minute: "numeric",
+    minute: "",
     second: "numeric",
     hour12: false,
killedBy: JobLogPage tests renders job log page successfully
statusReason: RangeError: Value  out of range for Intl.DateTimeFormat options property minute

[Killed] BooleanLiteral
src/main/components/OurTable.js:140:13
     hour: "numeric",
     minute: "numeric",
     second: "numeric",
-    hour12: false,
+    hour12: true,
     timeZone: "America/Los_Angeles",
   };
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  11/13/2022, 19:49:59
Received:
  11/13/2022, 7:49:59 PM

[Killed] BlockStatement
src/main/components/OurTable.js:146:25
   return {
     Header: label,
     id: label,
-    Cell: ({ cell }) => {
-      const date = new Date(getDate(cell));
-      const formattedDate = new Intl.DateTimeFormat("en-US", options).format(
-        date,
-      );
-      return <>{formattedDate}</>;
-    },
+    Cell: ({ cell }) => {},
   };
 }
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] StringLiteral
src/main/components/OurTable.js:148:53
     id: label,
     Cell: ({ cell }) => {
       const date = new Date(getDate(cell));
-      const formattedDate = new Intl.DateTimeFormat("en-US", options).format(
+      const formattedDate = new Intl.DateTimeFormat("", options).format(
         date,
       );
killedBy: JobLogPage tests renders job log page successfully
statusReason: RangeError: Incorrect locale information provided

[Killed] BlockStatement
src/main/components/OurTable.js:156:63
   };
 }
 
-export function CustomComponentColumn(label, renderComponent) {
-  return {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => renderComponent(cell),
-  };
-}
+export function CustomComponentColumn(label, renderComponent) {}
 
killedBy: JobLogPage tests renders job log page successfully
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
src/main/components/OurTable.js:157:10
 }
 
 export function CustomComponentColumn(label, renderComponent) {
-  return {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => renderComponent(cell),
-  };
+  return {};
 }
 
killedBy: JobLogPage tests renders job log page successfully
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
src/main/components/OurTable.js:160:11
   return {
     Header: label,
     id: label,
-    Cell: ({ cell }) => renderComponent(cell),
+    Cell: () => undefined,
   };
 }
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
