[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:36:40
     testJobMutation.mutate(data);
   };
   // ***** update courses job *******
-  const objectToAxiosParamsClearJobs = () => ({
-    url: "/api/jobs/all",
-    method: "DELETE",
-  });
+  const objectToAxiosParamsClearJobs = () => undefined;
 
   const objectToAxiosParamsUpdateCoursesJob = (data) => ({
killedBy: AdminJobsPage tests user can clear jobs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:38:13
   // ***** update courses job *******
   const objectToAxiosParamsClearJobs = () => ({
     url: "/api/jobs/all",
-    method: "DELETE",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can clear jobs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:47:10
   });
 
   const objectToAxiosParamsUpdateCoursesByQuarterJob = (data) => ({
-    url: `/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=${data.quarter}&ifStale=${data.ifStale}`,
+    url: ``,
     method: "POST",
   });
killedBy: AdminJobsPage tests user can submit the update course data by quarter job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/jobs/launch/updateQuarterCourses?quarterYYYYQ=20222&ifStale=true"
Received: ""

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:94:33
   );
   // Stryker restore all
 
-  const clearJobs = async () => {
-    clearJobsMutation.mutate();
-  };
+  const clearJobs = async () => {};
 
   const submitUpdateCoursesJob = async (data) => {
killedBy: AdminJobsPage tests user can clear jobs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
