[Survived] ArrayDeclaration
main/pages/Admin/JobLogPage.js:17:18
     data: job,
     error,
     status,
-  } = useBackend(["getJob", id], {
+  } = useBackend([], {
     method: "GET",
     url: `/api/jobs?id=${id}`,

[Killed] ConditionalExpression
main/pages/Admin/JobLogPage.js:22:7
     url: `/api/jobs?id=${id}`,
   });
 
-  if (status === "loading") {
+  if (false) {
     return <div>Loading...</div>;
   }
killedBy: JobLogPage tests renders loading state
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Error loading log for job 
      1

[Killed] ConditionalExpression
main/pages/Admin/JobLogPage.js:22:7
     url: `/api/jobs?id=${id}`,
   });
 
-  if (status === "loading") {
+  if (true) {
     return <div>Loading...</div>;
   }
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading...
    </div>

[Killed] BooleanLiteral
main/pages/Admin/JobLogPage.js:26:16
     return <div>Loading...</div>;
   }
 
-  if (error || !job) {
+  if (error || job) {
     return <div>Error loading log for job {id}</div>;
   }
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Error loading log for job 
      1

[Killed] ConditionalExpression
main/pages/Admin/JobLogPage.js:26:7
     return <div>Loading...</div>;
   }
 
-  if (error || !job) {
+  if (true) {
     return <div>Error loading log for job {id}</div>;
   }
killedBy: JobLogPage tests renders job log page successfully
statusReason: Error: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Error loading log for job 
      1

[Killed] EqualityOperator
main/pages/Admin/JobLogPage.js:30:7
     return <div>Error loading log for job {id}</div>;
   }
 
-  if (status === "error") {
+  if (status !== "error") {
     return <div>Error loading log for job {id}</div>;
   }
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Error loading log for job 
      1

[Killed] ArrowFunction
main/pages/Admin/JobLogPage.js:47:34
       Header: "Status",
       accessor: "status",
     },
-    CustomComponentColumn("Log", (cell) => (
-      <pre>{cell.row.original.log || "No log available"}</pre>
-    )),
+    CustomComponentColumn("Log", () => undefined),
   ];
 
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] StringLiteral
main/pages/Admin/JobLogPage.js:47:27
       Header: "Status",
       accessor: "status",
     },
-    CustomComponentColumn("Log", (cell) => (
+    CustomComponentColumn("", (cell) => (
       <pre>{cell.row.original.log || "No log available"}</pre>
     )),
killedBy: JobLogPage tests renders job log page successfully
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/pages/Admin/JobLogPage.js:48:13
       accessor: "status",
     },
     CustomComponentColumn("Log", (cell) => (
-      <pre>{cell.row.original.log || "No log available"}</pre>
+      <pre>{true}</pre>
     )),
   ];
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Line
Line
Line
Line
Line
Line

[Killed] LogicalOperator
main/pages/Admin/JobLogPage.js:48:13
       accessor: "status",
     },
     CustomComponentColumn("Log", (cell) => (
-      <pre>{cell.row.original.log || "No log available"}</pre>
+      <pre>{cell.row.original.log && "No log available"}</pre>
     )),
   ];
killedBy: AdminJobsPage tests navigates to job log page on See entire log link click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 12
+ Received  +  1

- Line
- Line
- Line

[Killed] ArrowFunction
main/pages/Admin/JobLogPage.js:54:24
 
   return (
     <div>
-      <button onClick={() => navigate(-1)}>Back</button>
+      <button onClick={() => undefined}>Back</button>
       <OurTable data={jobData} columns={columns} testid="JobLogTable" />
     </div>
killedBy: JobLogPage tests back button works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1

Number of calls: 0

[Killed] UnaryOperator
main/pages/Admin/JobLogPage.js:54:39
 
   return (
     <div>
-      <button onClick={() => navigate(-1)}>Back</button>
+      <button onClick={() => navigate(+1)}>Back</button>
       <OurTable data={jobData} columns={columns} testid="JobLogTable" />
     </div>
killedBy: JobLogPage tests back button works
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: -1
Received: 1

Number of calls: 1
